continuous_adjoint_method.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Continuous Adjoint Method</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Magí Romanyà Serrasolsas" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content">
<h1 class="title">Continuous Adjoint Method</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgbe8b5fa">Introduction</a></li>
<li><a href="#org8db570a">The problem setting</a></li>
<li><a href="#org61da400">Solving the minimization problem</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgbe8b5fa" class="outline-2">
<h2 id="orgbe8b5fa">Introduction</h2>
<div class="outline-text-2" id="text-orgbe8b5fa">
<p>
In my master thesis, I've been working in propagating adjoints backwards, which looked like the discretization of solving an ODE in reverse.
In this article, we are going to see that in fact, when using the back propagation algorithm, covered in this <a href="differential_simulation.html">article</a>, we are solving an ODE.
Also we are going to derive how does this ODE look like.
The work shown in this article relies heavily on the excellent standford tutorial found <a href="https://cs.stanford.edu/~ambrad/adjoint_tutorial.pdf">here</a>.
</p>
</div>
</div>

<div id="outline-container-org8db570a" class="outline-2">
<h2 id="org8db570a">The problem setting</h2>
<div class="outline-text-2" id="text-org8db570a">
<p>
First we are going to write down our notation and describe the problem we want to solve.
Analytically, solving a forward simulation, is equivalent as integrating a certain differential equation.
</p>
\begin{equation}
\label{eq:ode}
\newcommand{\totald}[2]{\frac{\mathrm{d}#1}{\mathrm{d}#2}}
\newcommand{\partiald}[2]{\frac{\partial#1}{\partial#2}}
\totald{\mathbf{s}}{t} = \mathbf{\hat{f}}(\mathbf{s}, \mathbf{p}, t)
,\quad \mathbf{s}(0)=\mathbf{s}_0
\end{equation}

<p>
To formulate our back propagation of adjoint states also as an ODE, we are going to need a description of the objective function.
The objective function in the continuous case is no longer a function but a functional.
It does not take variables as an input but whole functions, in this case is going to depend on the function \(\mathbf{s}(\mathbf{p},t)\).
</p>

\begin{equation}
\Phi(\mathbf{s}, \mathbf{p}) = \int_{0}^{T}\phi(\mathbf{s}, \mathbf{p}, t)\mathrm{d}t
\end{equation}

<p>
We can think of this integral as evaluating our function \(\mathbf{s}(t)\) at each point in time between 0 and \(T\), and feeding this result to an "instantaneous objective function" \(\phi\), and then summing all the results.
</p>

<p>
With all this formulation, we can finally write our minimization problem with constraints as:
</p>
\begin{equation}
\label{eq:minimization}
\arg \min_{\mathbf{p}} \Phi(\mathbf{s}, \mathbf{p}), \quad \text{subject to}
\begin{cases}
\mathbf{f}(\mathbf{s}, \totald{\mathbf{s}}{t}, \mathbf{p}, t) = 0 \\
\mathbf{g}(\mathbf{s}(0), \mathbf{s}_0) = 0
\end{cases}
\end{equation}
<p>
Where the \(\mathbf{f}\) and \(\mathbf{g}\) functions are the ODE and the initial conditions described in equation \eqref{eq:ode}, written in implicit form, \(\mathbf{f} \equiv \frac{\mathrm{d}\mathbf{s}}{\mathrm{d}t} - \mathbf{\hat{f}}\), \(\mathbf{g} \equiv \mathbf{s}(0) - \mathbf{s}_0\).
</p>
</div>
</div>

<div id="outline-container-org61da400" class="outline-2">
<h2 id="org61da400">Solving the minimization problem</h2>
<div class="outline-text-2" id="text-org61da400">
<p>
Now that we have the formulation of the problem, we can start solving it.
The problem is formally known as a minimization with constraints and can be approached using lagrange multipliers.
The first step towards solving the problem is to introduce the Lagrangian, with no constraints, which in this case is nothing more than our objective function:
</p>
\begin{equation}
\mathcal{L} = \Phi = \int_{0}^{T}\phi(\mathbf{s}, \mathbf{p}, t)\mathrm{d}t
\end{equation}

<p>
Now we want to introduce the constraints to this equation using Lagrange multipliers that we will define as the \(\lambda\) and \(\mu\) vectors.
</p>

\begin{equation}
\mathcal{L} = \int_{0}^{T}\left[\phi(\mathbf{s}, \mathbf{p}, t) + \lambda^T\mathbf{f}(\mathbf{s}, \totald{\mathbf{s}}{t}, \mathbf{p}, t) \right]\mathrm{d}t +
 \mu^T\mathbf{g}(\mathbf{s}(0), \mathbf{s}_0)
\end{equation}
<p>
Note that this holds because we have defined the \(\mathbf{f}\) and \(\mathbf{g}\) functions to be equal to zero in the formulation of the problem shown in \eqref{eq:minimization}.
Also this holds for any \(\lambda\) and \(\mu\), which means that we have the freedom to choose this Lagrange multipliers.
</p>

<p>
From here we will take the derivative of this Lagrangian with respect to the simulation parameters \(p\).
</p>
\begin{equation}
\label{eq:lagrangian-derivative}
\begin{split}
\totald{\mathcal{L}}{\mathbf{p}} = \int_{0}^{T}\left[
\partiald{\phi(\mathbf{s}, \mathbf{p}, t)}{\mathbf{p}} +
\partiald{\phi(\mathbf{s}, \mathbf{p}, t)}{\mathbf{s}}\totald{\mathbf{s}}{\mathbf{p}} +
\lambda^T\left(
\partiald{\mathbf{f}}{\mathbf{p}} +
\partiald{\mathbf{f}}{\mathbf{s}}\totald{\mathbf{s}}{\mathbf{p}} +
\partiald{\mathbf{f}}{\mathbf{\dot{s}}}\totald{\mathbf{\dot{s}}}{\mathbf{p}}
\right)\right]\mathrm{d}t \\ +
\mu^T\left(
\partiald{\mathbf{g}}{\mathbf{p}} +
\partiald{\mathbf{g}}{\mathbf{s}(0)}\totald{\mathbf{s}(0)}{\mathbf{p}}
\right)
\end{split}
\end{equation}

<p>
In this step we have applied the chain rule to all the functions present. Also we introduced the notation \(\mathbf{\dot{s}}\equiv\totald{\mathbf{s}}{t}\) to make the equation cleaner.
Now it is possible to write the term containing \(\totald{\mathbf{\dot{s}}}{\mathbf{p}}\) in terms of the derivative \(\totald{\mathbf{s}}{\mathbf{p}}\) by integrating by parts:
</p>
\begin{equation}
\int_0^T\lambda^T
\partiald{\mathbf{f}}{\mathbf{\dot{s}}}\totald{\mathbf{\dot{s}}}{\mathbf{p}}
\mathrm{d}t =
\left.\lambda^T\partiald{\mathbf{f}}{\mathbf{\dot{s}}}\totald{\mathbf{s}}{\mathbf{t}}\right|_0^T
-\int_0^T\left(
\totald{\lambda^T}{t}\partiald{\mathbf{f}}{\mathbf{\dot{s}}} +
\lambda^T\totald{}{t}\partiald{\mathbf{f}}{\mathbf{\dot{s}}}
\right)\totald{\mathbf{s}}{\mathbf{p}}
\mathrm{d}t
\end{equation}

<p>
Substituting this result into the Lagrangian derivative expression in \eqref{eq:lagrangian-derivative}, and grouping all the terms with the derivative \(\totald{\mathbf{s}}{\mathbf{p}}\), we can write:
</p>
\begin{equation}
\label{eq:lagrangian-derivative2}
\begin{split}
\totald{\mathcal{L}}{\mathbf{p}} = \int_{0}^{T}\left[
\left(
\partiald{\phi(\mathbf{s}, \mathbf{p}, t)}{\mathbf{s}} +
\lambda^T\left(
\partiald{\mathbf{f}}{\mathbf{s}} -
\totald{}{t}\partiald{\mathbf{f}}{\mathbf{\dot{s}}}
\right)-
\totald{\lambda^T}{t}\partiald{\mathbf{f}}{\mathbf{\dot{s}}}
\right)
\totald{\mathbf{s}}{\mathbf{p}} +
\partiald{\phi(\mathbf{s}, \mathbf{p}, t)}{\mathbf{p}} +
\lambda^T\partiald{\mathbf{f}}{\mathbf{p}}
\right]\mathrm{d}t +\\
\left.\lambda^T\partiald{\mathbf{f}}{\mathbf{\dot{s}}}\totald{\mathbf{s}}{\mathbf{t}}\right|_T +
\left.\left(
\mu^T\partiald{\mathbf{g}}{\mathbf{s}(0)}
- \lambda^T\partiald{\mathbf{f}}{\mathbf{\dot{s}}}
\right)\right|_0
\totald{\mathbf{s}(0)}{\mathbf{p}} +
\mu^T
\partiald{\mathbf{g}}{\mathbf{p}}
\end{split}
\end{equation}

<p>
This is one ugly expression, and a lot is going on.
Fortunately, we have still some freedom to deal with, as we have yet to fix our Lagrange multipliers \(\lambda\) and \(\mu\).
It is our main interest to avoid computing the sensitivity matrix \(\totald{\mathbf{s}}{\mathbf{p}}\), so we will choose our multipliers to cancel the terms where they appear.
</p>
\begin{align}
\left.\lambda^T\partiald{\mathbf{f}}{\mathbf{\dot{s}}}\totald{\mathbf{s}}{\mathbf{t}}\right|_T &= 0 \\
\left.\left(
\mu^T\partiald{\mathbf{g}}{\mathbf{s}(0)}
- \lambda^T\partiald{\mathbf{f}}{\mathbf{\dot{s}}}
\right)\right|_0 &= 0 \\
\partiald{\phi(\mathbf{s}, \mathbf{p}, t)}{\mathbf{s}} +
\lambda^T\left(
\partiald{\mathbf{f}}{\mathbf{s}} -
\totald{}{t}\partiald{\mathbf{f}}{\mathbf{\dot{s}}}
\right)-
\totald{\lambda^T}{t}\partiald{\mathbf{f}}{\mathbf{\dot{s}}}
&= 0
\end{align}

<p>
From the first equation, we can take \(\lambda(T) = 0\), which is a initial conditions equation. And from the second equation we can take \(\mu^T = \lambda^T\partiald{\mathbf{f}}{\mathbf{\dot{s}}}{\left(\partiald{\mathbf{g}}{\mathbf{s}(0)}\right)}^{-1}\).
Finally, from the last equation, we can write the following ODE that the \(\lambda\) multiplier has to fulfill.
</p>
\begin{equation}
\totald{\lambda^T}{t}\partiald{\mathbf{f}}{\mathbf{\dot{s}}}
=
\partiald{\phi(\mathbf{s}, \mathbf{p}, t)}{\mathbf{s}} +
\lambda^T\left(
\partiald{\mathbf{f}}{\mathbf{s}} -
\totald{}{t}\partiald{\mathbf{f}}{\mathbf{\dot{s}}}
\right)
\end{equation}

<p>
With these defined multipliers our Lagrangian gradient can be written in a nicer expression:
</p>
\begin{equation}
\totald{\mathcal{L}}{\mathbf{p}} = \int_{0}^{T}\left[
\partiald{\phi(\mathbf{s}, \mathbf{p}, t)}{\mathbf{p}} +
\lambda^T\partiald{\mathbf{f}}{\mathbf{p}}
\right]\mathrm{d}t +
\lambda^T\partiald{\mathbf{f}}{\mathbf{\dot{s}}}{\left(\partiald{\mathbf{g}}{\mathbf{s}(0)}\right)}^{-1}
\partiald{\mathbf{g}}{\mathbf{p}}
\end{equation}
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Magí Romanyà Serrasolsas</p>
</div>
</body>
</html>
